# 207_折扣方案

# 題目說明:

# 請使用選擇敘述撰寫一程式，要求使用者輸入購物金額，購物金額需大於8,000（含）以上，並顯示折扣優惠後的實付金額。購物金額折扣方案如下表所示：

# 金　　額	折　扣
# 8,000（含）以上	9.5折
# 18,000（含）以上	9折
# 28,000（含）以上	8折
# 38,000（含）以上	7折

x=eval(input("輸入購物金額："))

if x>=8000 and x<18000:
    print("折了多少錢：{}\n折扣後金額：{}".format(x-(x*0.95),x*0.95))
elif x>=18000 and x<28000:
    print("折了多少錢：{}\n折扣後金額：{}".format(x-(x*0.9),x*0.9))
elif x>=28000 and x<38000:
    print("折了多少錢：{}\n折扣後金額：{}".format(x-(x*0.8),x*0.8))
elif x>=38000:
    print("折了多少錢：{}\n折扣後金額：{}".format(x-(x*0.7),x*0.7))

# 範例輸入1

# 12000
# 範例輸出1

# 11400.0